<?php
/**
 * Created by PhpStorm.
 * User: mohammedsobhei
 * Date: 11/7/18
 * Time: 8:34 PM
 */

return [
    'success' => 'تم التنفيذ بنجاح',
    'error' => 'حدث خطأ',
    'updated' => 'نجحت عملية التحديث',
    'user_updated' => 'نجحت عملية التحديث',
    'not_updated' => 'فشلت عملية التحديث',
    'created' => 'نجحت عملية الانشاء',
    'not_created' => 'فشلت عملية الانشاء',
    'not_deleted' => 'فشلت عملية الحذف',
    'deleted' => 'تمت عملية الحذف بنجاح',

    'not_data_found' => 'لا يوجد بيانات',
    'invalid_token' => 'رمز غير صالح',
    'invalid_route' => 'رابط غير صالح',
    'client_input_error' => 'حدث خطأ من المستخدم',
    'server_error' => 'حدث خطأ من السيرفر',

    'error_confirmation' => 'لم يتم تأكيد رمز التحقق',
    'unauthorized' => 'البيانات غير صحيحة',
    'invited' => 'دعوة جديدة',
    'leaved' => 'مغادرة الفريق',

    'types' => [
        'cup' => 'كأس',
        'tournament' => 'دوري',
        'public' => 'عام',
        'invite' => 'خاص',
        'random'=>'عشوائية',
        'league'=>'بطولة',
        'challenge'=>'تحدي',
        'normal'=>'عادية',
    ],
    'days' => [
        'sat' => 'السبت',
        'sun' => 'الاحد',
        'mon' => 'الاثنين',
        'tue' => 'الثلاثاء',
        'wed' => 'الاربعاء',
        'thur' => 'الخميس',
        'fri' => 'الجمعة',
    ],
    'incorrect_mobile' => 'صيغة رقم الجوال خاطئة مثال: 966500000000',

    'group' => [
        '1' => 'الاولى',
        '2' => 'الثانية',
        '3' => 'الثالثة',
        '4' => 'الرابعة',
        '5' => 'الخامسة',
        '6' => 'السادسة',
        '7' => 'السابعة',
        '8' => 'الثامنة',
        '9' => 'التاسعة',
        '10' => 'العاشرة',
    ]
];


